assets/UserLogin.xml

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Body>
    <UserLogin xmlns="http://tempuri.org/">
      <username></username>
      <pass></pass>
      <phonenum></phonenum>
    </UserLogin>
  </soap12:Body>
</soap12:Envelope>